---
kind: method
id: M:Autodesk.Revit.DB.View3D.GetLevelsThatShowGrids
zh: 三维视图、3d视图
source: html/7e0d9d35-1b5a-90f6-ed28-8356f17cd7e1.htm
---
# Autodesk.Revit.DB.View3D.GetLevelsThatShowGrids Method

**中文**: 三维视图、3d视图

Returns the list of levels ids where grids are displayed in this 3D view.

## Syntax (C#)
```csharp
public ISet<ElementId> GetLevelsThatShowGrids()
```

## Returns
The list of levels ids where grids are displayed in 3D views.